<?php
use yii\helpers\Html;
use yii\helpers\Url;
use app\Assets\GalleryAsset;

/* @var $this yii\web\View */
/* @var $images images */
/* @var $instructors instructors */

$this->registerJsFile('@web/js/main_page.js');
GalleryAsset::register($this);

$this->title = 'Турнір юних інформатиків';
?>
  <div class="rules-header">
    <h1>Правила проведення Всеукраїнського турніру юних інформатиків</h1>
    <h2> Загальні положення про Турнір Юних Інформатиків </h2>
  </div>
<div class="rules-content">
  <p> 
    Турнір юних інформатиків (далі ТЮІ) проводиться відповідно до Положення про Всеукраїнські учнівські олімпіади з базових і спеціальних дисциплін, турніри, конкурси-захисти науково-дослідницьких робіт та конкурси фахової майстерності, затвердженого наказом Міністерства освіти України від 18 серпня 1998 р. № 305. Правила Всеукраїнського ТЮІ розробляються та затверджуються Організаційним Комітетом (ОК) і можуть змінюватися лише ним.
  </p>

  <p>
  ТЮІ є командним змаганням школярів, що доводить їх здатність вирішувати складні наукові та дослідницькі завдання, подавати свої розв’язки у доведеній до впровадження формі, захищати їх під час наукової дискусії.
  </p>
  <h2 class="rules-subheader"> Учасники ТЮІ </h2>
  <p> У Турнірі беруть участь команди-переможці регіональних, обласних і міських ТЮІ. </p>

  <p>
    До участі у ТЮІ допускається команда у складі 3-5 учнів загальноосвітніх навчальних закладів. Особовий склад команди не повинен змінюватись протягом усього Турніру. Команда-учасниця очолюється капітаном, який є офіційним представником команди під час проведення Турніру.
  </p>
  <p>
  Команди, що бажають взяти участь у фінальному етапі змагань, після проведення першого етапу Турніру, подають заявки до ОК Турніру, який приймає рішення щодо запрошення команд на змагання.
  </p>
  <h2 class="rules-subheader"> Склад журі ТЮІ </h2>

  <p>
  Журі формується ОК ТЮІ. До нього входять незалежні представники та керівники команд. Незалежні члени журі розподіляються ОК ТЮІ по групах учасників Турніру, що змагаються. Керівники команд не можуть бути членами журі в тих групах і видах змагань, де змагаються їх команди, і розподіляються по групах за схемами, що подаються ОК ТЮІ.
  </p>
  
  <h2 class="rules-subheader">Завдання ТЮІ</h2>
  <p>
  Умови завдання І етапу та технічні умови їх виконання формуються ОК і оголошуються за три місяці до початку Турніру. Це завдання використовується для проведення регіональних, обласних і міських турнірів. Про терміни і результати проведення цих турнірів повідомляється оргкомітетові Всеукраїнського ТЮІ.
  </p>
  
  <p>Задачі фінального етапу формуються ОК ТЮІ із представлених членами журі. </p>

 <h2 class="rules-subheader"> Заходи, що проводяться в межах Турніру </h2>
 <p>
  Турнір проводиться у два етапи:
  <ul type="circle">
    <li>І етап;</li>
    <li>фінальний етап.</li>
  </ul>
  Турнір проводиться за графіком, затвердженим ОК ТЮІ.
  </p>
  <h2 class="rules-subheader">Правила проведення І етапу</h2>
  <p>Завдання <b>І етапу</b> передбачає розробку і доведення до стану впровадження задачі-проекту.</p>
  
  <p>Виконання задачі-проекту передбачає:</p>
  <ul>
    <l1>доведення задачі до стану готового програмного продукту;</l1>
    <li>наявність супроводжуючої технічної документації.</li>
  </ul>

  <h2 class="rules-subheader"> Представлення заявок командами-учасницями </h2>
  <p>
    За місяць до початку фінального етапу ТЮІ всі команди, що бажають взяти участь у Турнірі, повинні подати до ОК ТЮІ заявку з такою інформацією:
  </p>
  <ul>
    <li>кого представляє дана команда;</li>
    <li>прізвище, ім’я, по батькові керівника команди;</li>
    <li>кількість членів команди;</li>
    <li>анкетні дані про керівника команди та членів команди (місце роботи та посада керівника команди; місце навчання, вік та в яких класах навчаються члени команди);</li>
    <li>перелік технічних засобів (проектори, відео, аудіо апаратура тощо) та відповідної програмної підтримки, необхідних команді для участі у фінальному етапі ТЮІ.</li>
  </ul>
  <h2 class="rules-subheader"> Правила проведення і оцінювання завдань фінального етапу </h2>
  <b>Фінальний етап ТЮІ</b> передбачає змагання команд-учасниць в трьох турах. Кожна команда-учасниця повинна взяти участь не менше, ніж в двох турах (захист задачі-проекту І етапу Турніру є обов’язковим для всіх команд-учасниць).

  <p>
  На час проведення фінального етапу ТЮІ усім командам-учасницям надається однакова за технічними можливостями комп’ютерна техніка, основні параметри якої не перевищують такі характеристики:
  </p>
  <ul>
    <li>тактова частота процесора — 1 Ггц;</li>
    <li>RAM — 128 Мб;</li>
    <li>HDD — 10 Гб;</li>
    <li>CD-ROM;</li>
    <li>відео пам’ять — 4 Мб.</li>
  </ul>
  <h2 class="rules-subheader"> Реєстрація команд-учасниць </h2>
  <p>Перед початком фінального етапу Турніру капітани всіх команд-учасниць повинні пройти реєстрацію:</p>
  <ul>
    <li>підтвердити склад команди;</li>
    <li>подати заявки на участь команди у турах Турніру;</li>
    <li>підтвердити перелік технічних засобів, необхідних для захисту завдання І етапу, та відповідної програмної підтримки;</li>
    <li>подати до журі ТЮІ електронні версії завдань І етапу (текст програми, exe-файл) та документацію у друкованому вигляді.</li>
  </ul>

  <h2 class="rules-subheader"> Тури фінального етапу </h2>
  <p><b> 1 тур: захист задачі-проекту І етапу </b></p>

  <p>У даному виді змагань ТЮІ беруть участь ті члени команд, що заявлені капітанами відповідних команд під час реєстрації.</p>

  <p>Захист задачі-проекту кожною командою-учасницею відбувається під час проведення дискусій між командою-доповідачем, командою-опонентом та командою-рецензентом за графіком, визначеним ОК ТЮІ.</p>

  <p>Для представлення завдання І етапу перед початком дискусії команда-доповідач отримує у журі ТЮІ свій диск з електронною версією даного завдання та встановлює її на демонстраційному ПК. </p>

  <p>У даному виді змагань кожна команда-учасниця повинна виступити у кожній із трьох (двох або чотирьох) ролей: команда-доповідач, команда-опонент, команда-рецензент (команда-спостерігач).</p>

 <h2 class="rules-subheader"> Оцінювання завдання І етапу </h2>
 <p>Заочне оцінювання членами журі завдання І етапу відбувається перед початком його захисту командами-учасницями.</p>

 <p>Виконання завдання І етапу кожною командою-доповідачем оцінюється журі Турніру за такими критеріями: </p>
 <ul>
  <li>інсталяція програми (10 балів);</li>
  <li>інтерфейс програми (20 балів);</li>
  <li>технічна документація (10 балів);</li>
  <li>інструкція для користувача (10 балів);</li>
  <li>досконалість реалізації задачі (35);</li>
  <li>ефективність роботи програми (35 балів).</li>
 </ul>
 <h2 class="rules-subheader"> Правила ведення дискусії </h2>
  
  <p>
    У захисті задач 1-ого туру Турніру беруть участь члени команди, що визначаються капітанами команд. Для дискусії ОК Турніру визначає такі трійки команд: команду-доповідача (Д), команду-опонента (О) та команду-рецензента (Р). За схемою, розробленою ОК ТЮІ, кожна команда виступатиме по одному разу в одній з трьох ролей. Для проведення такого виду змагань ОК ТЮІ застосовує таку схему:
  </p>

Трикомандна дискусія

Команда

Дія
1

2

3

1

Д Р 
О

2

О Д 
Р

3 Р О 
Д

В деяких випадках можуть застосовуватись і такі схеми дискусій.

Двокомандна дискусія

Команда

Дія

1

2

1

Д 
О

2

О 
Д

При поділі команд на четвірки вводиться ще одна діюча особа у дискусії — команда-спостерігач. При цьому застосовується така схема:

Чотирикомандна дискусія

Команда

Дія

1

2 3 
4

1

Д С Р О
2

О Д С 
Р

3

Р О Д 
С

4 С Р О 
Д

Під час захисту команда-опонент може задати до 5 запитань команді-доповідачу. Журі Турніру оцінює ведення дискусії всіма діючими сторонами захисту згідно таких критеріїв:

професійність (5 балів);
чіткість, конкретність (5 балів);
зрозумілість (5 балів);
логічність (5 балів);
коректність (5 балів).
Дискусія між командою-доповідачем та командою-опонентом оцінюється командою-рецензентом за аналогічними критеріями і подається до журі Турніру зразу ж по її завершенні.

Протягом захисту члени команд, що беруть участь у захисті, можуть використовувати тайм-аут для консультації з рештою членів команди, але не можуть консультуватися з будь-якою особою, яка не є членом команди.

Регламент ведення дискусії

На захист команді-доповідачу відводиться до 60 хвилин. З них:

захист задачі-проекту:
представлення особливостей алгоритму задачі — 10 хв.;
демонстрація роботи програми                             — 15 хв.;
запитання опонента і відповіді на них                  — 15 хв.;
слово рецензента                                                  ? 5 хв.;
консультації з командою (тайм-аут)                     — 3 хв.;
підсумкове слово доповідача                               — 5 хв.;
виставлення оцінок                                               — 2 хв.
Виступи команд протягом захисту

Команда-доповідач. Під час доповіді членів команди викладається основна суть алгоритму розробленої задачі, акцентується увага на основних ідеях, демонструються основні частини програми та робляться висновки. Під час доповіді доповідачами при необхідності можуть застосовуватись технічні засоби, демонструватись плакати, малюнки, слайди, фотографії тощо.

Технічні засоби, необхідні команді-доповідачу для доповіді, повинні бути замовлені при реєстрації команд.

Команда-опонент. Представник команди-опонента висловлює критичні зауваження щодо доповіді команди-доповідача, відзначаючи та обґрунтовуючи як позитивні, так і негативні сторони цієї доповіді. Виступ команди-опонента не повинен містити викладення власного алгоритму задачі.

Команда-рецензент. Представник команди-рецензента дає коротку оцінку виступам представників команди-доповідача та команди-опонента, обґрунтовуючи свої зауваження та не викладаючи при цьому власного погляду на алгоритм даної задачі.

Команда-спостерігач. Команда-спостерігач має право брати участь в загальній полеміці команд.

Ведучий дискусії
Завданням ведучого є створення умов для нормального проведення дискусії.

Обов’язки:

слідкувати за дотриманням регламенту;
створювати умови для нормальної роботи журі (слідкувати за поведінкою команд, зачитувати умови задач тощо);
слідкувати за характером запитань і за тим, щоб вони не повторювались;
слідкувати за дискусією і припиняти її, якщо вона стає неконструктивною;
слідкувати за тим, щоб запитання журі носили лише уточнюючий характер;
визначати спосіб початкового розподілу ролей (жеребкування тощо);
слідкувати за тим, щоб поруч з командами не знаходились особи, що не є членами команд.
В обов’язки ведучого не входить:

перевіряти правильність висловлювань учасників;
пояснювати оцінки членів журі;
відповідати на будь-які спірні запитання, що не стосуються прав і обов’язків ведучого.
Ведучий має право:

зупиняти учасника, який порушив регламент ТЮІ;
вилучати запитання, що повторюються;
припиняти дискусію, якщо вона стає неконструктивною;
усувати команду від участі в дискусії, якщо вона постійно порушує правила ТЮІ або своєю поведінкою заважає проведенню дискусії (з дозволу членів журі);
у разі потреби надавати додатковий час для учасників (з дозволу членів журі);
надавати слово керівникам команд або глядачам (тільки після виставлення оцінок).
Ведучий не має права:

порушувати регламент (за винятком пп.5,6 попереднього розділу);
зупиняти учасників до закінчення часу, відведеного на їх виступ;
якимось чином коментувати виступ і висловлювати свою думку;
ставити спрямовуючі запитання.
Права і обов’язки ведучого визначаються ОК ТЮІ і не можуть змінюватися протягом роботи ТЮІ.

Оцінювання виступів команд
Оцінювання виступів команд здійснюється лише членами журі, які не є керівниками даної команди.

Оцінювання команди здійснюється наступним чином.

Кожний член журі оцінює виступ команди-учасниці як суму балів, виставлених ним даній команді по кожній дії окремо за відповідною шкалою оцінювання з врахуванням таких коефіцієнтів:

у ролі доповідача — коефіцієнт 2;
у ролі опонента — коефіцієнт 1;
у ролі рецензента — коефіцієнт 0,5.
Остаточні бали, якими оцінюється виступ команди-учасниці у 1-му турі, визначаються як середнє від всіх наявних оцінок членів журі, за виключенням однієї найвищої та однієї найнижчої оцінок. Загальна максимальна кількість балів, якою може бути оцінений виступ команди-учасниці у 1-му турі, становить 207,5.

2 тур ? розробка задачі-проекту

У даному виді змагань Турніру беруть участь члени команд, що заявлені капітанами команд під час реєстрації. Зміни  у складі учасників 2 туру можливі лише за день до його початку згідно письмової заяви капітана команди, поданої до ОК Турніру.

Умова задачі-проекту 2 туру фінального етапу визначається на засіданні журі  ТЮІ із задач, що були представлені в ОК ТЮІ членами журі.
Умова задачі командам видається на початку змагання у роздрукованому вигляді.

Час, необхідний для виконання отриманих завдань, визначається журі ТЮІ (до 6 астрономічних годин).

Для виконання завдання цього туру змагань кожній команді надається по два персональних комп’ютери однотипної конфігурації, що визначається на засіданні журі ТЮІ, та на яких встановлені наперед замовлені командами візуальні та процедурні середовища програмування.

Під час виконання завдань забороняється присутність осіб, що не є членами команди, визначеними для участі у цьому виді змагань.

Результатом виконання завдання 2 туру ТЮІ повинен бути повноцінно розроблений програмний продукт, що реалізує сформульовану задачу, має зручний розгорнутий інтерфейс, супроводжуючу технічну документацію та інструкцію для користувача в електронному вигляді (до 3-х сторінок формату А4).

Після завершення 2 туру до журі Турніру капітаном кожної команди-учасниці подається:

текстові файли з кодами програмних продуктів;
exe-файл програмного продукту;
документація до програмного продукту в електронному вигляді.
За рішенням журі Турніру командам-учасницям відводиться по 10 хвилин на представлення розроблених проектів.

За рішенням журі Турніру команди-учасниці можуть подати літературу для її загального використання під час виконання завдань туру.

Оцінювання розроблених програмних продуктів
Виконання завдання 2 туру кожною командою-учасницею оцінюється журі Турніру за такими критеріями:

повнота реалізації поставленої задачі (35 балів);
досконалість інтерфейсу (сервіс, дизайн) програмного продукту (20 балів);
досконалість роботи програмного продукту (ефективність, захист від несанкціонованих дій користувача) (25 балів).
документація до програмного продукту (10 балів);
презентація власної реалізації задачі-проекту (10 балів).
Остаточні бали, якими оцінюється виступ команди-учасниці у 2 турі ТЮІ, визначаються як середнє від всіх наявних оцінок членів журі, за виключенням однієї найвищої і однієї найнижчої оцінок та балів тих членів журі, що є керівниками даної команди.

3 тур ? розв’язування алгоритмічних задач

У цьому виді змагань ТЮІ беруть участь ті члени команд, що заявлені капітанами відповідних команд під час реєстрації. Зміни  у складі команд можливі  не пізніше ніж за годину до початку змагання  згідно письмової заяви капітана відповідної команди, поданої до ОК ТЮІ.

Задачі 3 туру фінального етапу та їх кількість визначаються на засіданні журі  ТЮІ із задач, що були представлені в ОК ТЮІ членами журі.
Задачі командам видаються на початку змагання в роздрукованому вигляді.

Час, необхідний для виконання отриманих завдань, визначається журі ТЮІ (до 5 астрономічних годин).

Для виконання завдань 3 туру кожній команді надається один персональний комп’ютер з конфігурацією інтегрованих середовищ програмування відповідно до поданої заявки.

Під час виконання завдань забороняється присутність осіб, що не є членами команди, визначеними для участі в цьому виді змагань.

Команди можуть задавати письмові запитання щодо умов задач протягом першої години змагань. Відповіді команді надаються в письмовій формі у вигляді „так”, „ні”, „немає відповіді” протягом 10 хвилин після отримання запитання. При виявлені помилок в умовах задач або в тестових прикладах журі зобов’язане повідомити про них всі команди одночасно.

Протягом виконання завдань капітани команд подають до журі Турніру електронні версії розв’язків задач:

текстовий файл з кодом програми;
exe-файл програми.
Відповідь щодо правильності розв’язку поданої задачі журі зобов’язане відіслати команді протягом 10 хвилин з моменту його отримання.

Інформація про хід змагання, тобто кількість розв’язаних задач кожною командою-учасницею, кількість підходів для перевірки кожної задачі командами-учасницями, час, витрачений на розв’язування кожної зарахованої задачі, та загальний час, що відповідна команда витратила на всі зараховані задачі, фіксується на спеціальному табло та поновлюється кожні 15-20 хвилин.

Доставка файлів з розв’язками задач здійснюється мережею або за допомогою дискет, наданих кожній команді ОК ТЮІ.

Перевірка поданих розв’язків здійснюється членами журі за допомогою розроблених тестів для кожної задачі.

За півгодини до кінця туру журі припиняє видавати інформацію про надходження розв’язків та стан загального положення команд.

Оцінювання завдань 3 туру фінального етапу
Журі перевіряє програму з розв’язком задачі на визначених тестах і письмово повідомляє команду про позитивний або негативний результат перевірки з такими позначками:

“+” ? задача розв’язана повністю;
“RTE” ? помилка при роботі програми;
“TL” ? перевершення ліміту часу проходження тесту;
“WR” ? невірний результат;
“C” ? програма не компілюється;
“F” ? помилка при роботі з файлами.
При повному розв’язку поданої в журі ТЮІ задачі команді, що її розв’язала, додається десять балів. Також до загального часу даної команди додається час, витрачений на розв’язання цієї задачі, що визначається як сума часу від початку змагань до моменту зарахування задачі та штрафний час по 10 хвилин за кожний нерезультативний підхід по цій задачі.

Переможцем 3 туру фінального етапу ТЮІ вважається команда, яка розв’язала найбільшу кількість задач. При рівній кількості розв’язаних задач у декількох команд кращим вважається результат у команди, яка має менший сумарний час, витрачений на розв’язання всіх задач, що відображається у додаткових балах за призові місця.

Кількість балів, що йде у залік 3 туру, визначається сумою таких балів:

5, 3, 1 балів відповідно за 1, 2 або 3 призове місце;
по 10 балів — за кожну розв’язану задачу;
25 балів за участь команди в турі.

Апеляція
У випадку, якщо команда не погоджується з оцінкою її участі в тому чи іншому виді змагань, вона має право подати апеляцію до ОК Турніру. Апеляція подається у письмовому вигляді капітаном команди не пізніше, ніж через годину після оголошення результатів даного виду змагань і повинна містити:

виклад факту порушення;
посилання на ті пункти даних правил, що були порушені.
Рішення про розгляд апеляції приймає апеляційна комісія, призначена ОК Турніру до початку змагань. У випадку позитивного рішення щодо розгляду апеляції її зміст повинен бути розглянутий журі ТЮІ.

Відповідь ОК ТЮІ за підписом голови журі Турніру апелююча команда отримує у письмовому вигляді до початку наступного виду змагань.

Переможці Турніру
Переможці у загальній командній першості визначаються за сумарною кількістю балів, отриманих всією командою протягом всього фінального етапу Турніру, і нагороджуються дипломами І, ІІ та ІІІ ступенів.

При визначенні кількості команд-переможців їх число не може перевищувати 50% від загальної кількості команд-учасниць фінального етапу Турніру. Орієнтовний розподіл дипломів І, ІІ та ІІІ ступенів визначається у співвідношенні 1:2:3.

Журі надається право більшістю голосів всіх членів журі відзначити команди та окремих членів команд спеціальними грамотами Турніру.
Спонсори та партнери
Школа програмування
kspu
22
ТОВ "Згода" Соловчук І.М.


  </div>